<?php
//разряд числа
$aE = 1;
$bE = 10;
$cE = 100;
$dE = 1000;
//заданнные по условиям числа
$a = 0;
$b = 2;
$c = 3;
$d = 7;

for($i = 1; $i < 10; $i++){
    for($n = 0; $n < 10; $n++){
        for($x = 0; $x < 10; $x++){
            for($y = 0; $y < 10; $y++){

                if( ($i == $a || $i == $b || $i == $c || $i == $d) &&
                    ($n == $a || $n == $b || $n == $c || $n == $d) &&
                    ($x == $a || $x == $b || $x == $c || $x == $d) &&
                    ($y == $a || $y == $b || $y == $c || $y == $d)){
                    $M = $i * $dE + $n * $cE + $x * $bE + $y * $aE;
                    echo $M;
                    echo '|';
                }
            }
        }
    }
}