<?php
//разряд числа
$aE = 1;
$bE = 10;
$cE = 100;
$dE = 1000;

for($i = 1; $i < 10; $i++){
    for($n = 0; $n < 10; $n++){
        for($x = 0; $x < 10; $x++){
            for($y = 0; $y < 10; $y++){

                if( ($i != $n && $i != $x &&  $i != $y) &&
                    ($n != $x && $n != $y) && ($x != $y) ){//проверка на уникальность
                        $M = $i * $dE + $n * $cE + $x * $bE + $y * $aE;
                        echo $M;
                        echo '|';
                }
            }
        }
    }
}